Конфигурация/Documents/ПереоценкаКредитныхИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПереоценкаКредитныхИнструментов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоцениватьНаОснованииНастроекУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КредитныеИнструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КредитныйИнструмент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номинал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БалансоваяСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценочнаяСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоЭСП</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccountingRegisters/ЕдиныйБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccountingRegister>
		<Properties>
			<Name>ЕдиныйБухгалтерскийУчет</Name>
			<ChartOfAccounts>ChartOfAccounts.Единый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОпераций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РасчетныеПоказателиДепозитногоВклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РасчетныеПоказателиДепозитногоВклада</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭффективнаяСтавкаПроцента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЭффективнаяПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЭффективнуюПроцентнуюСтавку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьПоЭффективнойПроцентнойСтавке</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДепозитныйВклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦельРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксНумерации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаУчета</Name>
					<Comment>Ранее этой даты проведение документов запрещено</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольОтветственныхЗаОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольПодтвержденийОпераций</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольДоступаКСчетамДоверительногоУправления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПапкиВФайловомХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Documents/ПереоценкаКредитныхИнструментов/Ext/ObjectModule.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	//ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "");
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда // блокирующие проверки
		
		// !!! почему так - см. в обработке проведения
		//Если Не РегистрыСведений.НастройкиУчетаОбщие.ВедетсяУчетПоВиду(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ВидУчета) Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + " у " + ЭтотОбъект.СчетДоверительногоУправления + " не ведется " + ЭтотОбъект.ВидУчета,,,, Отказ);
		//	Возврат;
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведенияЕПС(Отказ, Режим)

	// определим возможность проведения документа
	ПереоценкаПослеВводаНачальныхОстатков = Ложь;
	ДатаПереоценки = началоДня(ЭтотОбъект.Дата);
	
	ВедетсяУчетПоТекущемуВиду = РегистрыСведений.НастройкиУчетаОбщие.ВедетсяУчетПоВиду(
		ДатаПереоценки,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.ВидУчета);	
	
	Если Не ВедетсяУчетПоТекущемуВиду Тогда // в случае ввода нач. остатков переоценку также разрешаем
		ВедетсяУчетПоТекущемуВиду = РегистрыСведений.НастройкиУчетаОбщие.ВедетсяУчетПоВиду(
			ДатаПереоценки + 24 * 60 * 60,
			ЭтотОбъект.Организация,
			ЭтотОбъект.СчетДоверительногоУправления,
			ЭтотОбъект.ВидУчета);
			
		Если Не ВедетсяУчетПоТекущемуВиду Тогда
			Возврат;
		КонецЕсли;		
			
		ПереоценкаПослеВводаНачальныхОстатков = Истина;
	КонецЕсли;
	
	Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	
	МассивУчетныхАктивов = Новый Массив;
	// формирование проводок
	Для Каждого ТекСтрокаДепозиты Из КредитныеИнструменты Цикл
		
		Если ТипЗнч(ТекСтрокаДепозиты.КредитныйИнструмент) <> Тип("СправочникСсылка.ДепозитныеВклады") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Переоценка ЕПС возможна только для депозитных вкладов!",Ссылка,,,Отказ);
			Возврат;
		КонецЕсли;
		
		УчетныйАктив = Справочники.ДепозитныеВклады.ОпределитьУчетныйАктивДепозита(ТекСтрокаДепозиты.КредитныйИнструмент, ЭтотОбъект.Дата);
		
		Если МассивУчетныхАктивов.Найти(УчетныйАктив) = Неопределено Тогда
			МассивУчетныхАктивов.Добавить(УчетныйАктив);
		КонецЕсли;
		
		НачислитьПроцентов = (ТекСтрокаДепозиты.ОценочнаяСумма - ТекСтрокаДепозиты.БалансоваяСумма);
		
		Если НачислитьПроцентов > 0 Тогда
		
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(НачислитьПроцентов, ТекСтрокаДепозиты.КредитныйИнструмент.БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Доначисление процентов по депозитному вкладу");
			
			// дебет
			Проводка.СчетДт = УчетныйАктив.СчетУчетаПереоценкиА;
			Проводка.СубконтоДт.Контрагенты = ТекСтрокаДепозиты.КредитныйИнструмент.БанковскийСчет.Банк.ЮрФизЛицо;
			Проводка.СубконтоДт.УсловияЗаймовКредитовИДепозитов = ТекСтрокаДепозиты.КредитныйИнструмент;
			Проводка.ВалютаДт  = ТекСтрокаДепозиты.КредитныйИнструмент.БанковскийСчет.Валюта;
			Проводка.ВалютнаяСуммаДт = НачислитьПроцентов;
			
			Если ПереоценкаПослеВводаНачальныхОстатков Тогда
				Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
				Проводка.СубконтоКт.Договоры = СчетДоверительногоУправления;
			Иначе
				Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеДоходы01;
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтПереоценки;
				Проводка.СубконтоКт.ЦенныеБумаги = ТекСтрокаДепозиты.КредитныйИнструмент;
			КонецЕсли;

		КонецЕсли;
		
		Если ТекСтрокаДепозиты.СуммаПоЭСП > 0 Тогда
			
			БухгалтерскийУчетЕПС.ПровестиКорректировкуЭСП(ЭтотОбъект, ТекСтрокаДепозиты.КредитныйИнструмент, ТекСтрокаДепозиты.ОценочнаяСумма, ТекСтрокаДепозиты.СуммаПоЭСП, ПереоценкаПослеВводаНачальныхОстатков);
			
		КонецЕсли;
		
	КонецЦикла;

	БухгалтерскийУчетЕПС.ЗачестьНачисленныеИПолученныеПроцентыПоДепозитнымВкладам(ЭтотОбъект, Закрывать7ойРазделПриПоступленииДенежныхСредств);
	
	БухгалтерскийУчетЕПС.ЗакрытьПарныеСчетаДоходовРасходов(ЭтотОбъект, МассивУчетныхАктивов, Ложь, Истина, ЭтотОбъект.КредитныеИнструменты.ВыгрузитьКолонку("КредитныйИнструмент"), Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ДатаПереоценки = НачалоДня(ЭтотОбъект.Дата);
	
	УчетныйРегистр = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета);
	Движения[УчетныйРегистр].Записывать = Истина;
	
	Если ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
		ОбработкаПроведенияЕПС(Отказ, Режим);
		Возврат;
	КонецЕсли;
	
	// определим возможность проведения документа
	ВедетсяУчетПоТекущемуВиду = РегистрыСведений.НастройкиУчетаОбщие.ВедетсяУчетПоВиду(
		ДатаПереоценки,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.ВидУчета);
		
	Если Не ВедетсяУчетПоТекущемуВиду Тогда
		Возврат;
	КонецЕсли;		
	
	// формирование проводок
	НастройкиУчетаПереоценки = БухгалтерскийУчет.ОпределитьНастройкиУчетаПереоценки(
		ДатаПереоценки,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.ВидУчета);
		
	УчитыватьДосрочноПолученныеПроцентыПоДепозитнымВкладамВДоходахБудущихПериодов = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		Справочники.УчетныеАктивы.ДепозитныеВклады,
		ЭтотОбъект.ВидУчета,
		"УчитыватьДосрочноПолученныеПроцентыВДоходахБудущихПериодов");		
		
		
	Если УчитыватьДосрочноПолученныеПроцентыПоДепозитнымВкладамВДоходахБудущихПериодов Тогда // По каким депозитам и сколько было досрочных процентов
		ВидыСубконто = Новый Массив;
	    ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухгалтерскийУчетОстатки.Субконто2 КАК ДепозитныйВклад,
			|	БухгалтерскийУчетОстатки.СуммаОстатокКт
			|ИЗ
			|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|			&Период,
			|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ДоходыБудущихПериодов),
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Субконто1 = &СубконтоПроцентыПоВкладам) КАК БухгалтерскийУчетОстатки
			|ГДЕ
			|	БухгалтерскийУчетОстатки.СуммаОстатокКт > 0";

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
			
		Запрос.УстановитьПараметр("Период",                       ЭтотОбъект.Дата);	
		Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("СубконтоПроцентыПоВкладам", Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Проценты по депозитным вкладам"));

		ДоходыБудущихПериодов = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	ВидыПредоставленныхЗаймов = Новый Массив;
	ВидыПредоставленныхЗаймов.Добавить(Справочники.УчетныеАктивы.ДепозитныеВклады);
	ВидыПредоставленныхЗаймов.Добавить(Справочники.УчетныеАктивы.ЗаймыВыданные);
	
	СчетДоходов 	= ПланыСчетов.Основной.ПрочиеДоходы;
	СчетРасходов 	= ПланыСчетов.Основной.ПрочиеРасходы;
	
	
	Для Каждого ТекСтрокаКредитныеИнструменты Из КредитныеИнструменты Цикл
		
		УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(ЭтотОбъект.Дата,, ТекСтрокаКредитныеИнструменты.КредитныйИнструмент);
			
		СчетУчета = БухгалтерскийУчет.ОпределитьСчетУчетаАктивов(
			ЭтотОбъект.Дата,
			ЭтотОбъект.Организация,
			ЭтотОбъект.СчетДоверительногоУправления,
			УчетныйАктив,
			ЭтотОбъект.ВидУчета);
			
		СчетУчетаПереоценки = БухгалтерскийУчет.ОпределитьСчетУчетаПереоценкиАктивов(
			ЭтотОбъект.Дата,
			ЭтотОбъект.Организация,
			ЭтотОбъект.СчетДоверительногоУправления,
			УчетныйАктив,
			ЭтотОбъект.ВидУчета);
			
		АналитикаДоходовОтПереоценки = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(
			ЭтотОбъект.Дата,
			ЭтотОбъект.Организация,
			ЭтотОбъект.СчетДоверительногоУправления,
			УчетныйАктив,
			ЭтотОбъект.ВидУчета,
			"АналитикаДоходовОтПереоценки");	
			
		УчитыватьПереоценкуОтдельно = НастройкиУчетаПереоценки[УчетныйАктив.ИмяПредопределенныхДанных];
		
		НазваниеВРодительномПадеже = РаботаСКредитнымиИнструментами.НазваниеКредитногоИнструментаРодительныйПадеж(ТекСтрокаКредитныеИнструменты.КредитныйИнструмент);
			
		
		СуммаПроводки = (ТекСтрокаКредитныеИнструменты.ОценочнаяСумма - ТекСтрокаКредитныеИнструменты.БалансоваяСумма);
		
		Если СуммаПроводки <> 0 Тогда
			
			УвеличениеСтоимости = СуммаПроводки > 0;
			
			СторонаКредитногоИнструмента = ?(ВидыПредоставленныхЗаймов.Найти(УчетныйАктив) <> Неопределено, "Дт", "Кт");
			СторонаДоходовРасходов = ?(СторонаКредитногоИнструмента = "Дт", "Кт", "Дт");
			СчетДоходаРасхода = ?(ВидыПредоставленныхЗаймов.Найти(УчетныйАктив) <> Неопределено, СчетДоходов,  СчетРасходов);
			
			Если НЕ УвеличениеСтоимости Тогда
				
				//по задаче 347156 - Если оценочная сумма меньше балансовой, значит проценты были получены сразу. Ничего не делаем. 
				Если УчетныйАктив = Справочники.УчетныеАктивы.ДепозитныеВклады Тогда
					Продолжить;
				КонецЕсли;
				
				СуммаПроводки = - СуммаПроводки;
				
				СторонаКредитногоИнструмента = ?(СторонаКредитногоИнструмента = "Дт", "Кт", "Дт");
				СторонаДоходовРасходов = ?(СторонаДоходовРасходов = "Дт", "Кт", "Дт");
				СчетДоходаРасхода = ?(СчетДоходаРасхода = СчетРасходов, СчетДоходов,  СчетРасходов);
				
			КонецЕсли;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаПроводки, "Переоценка " + НазваниеВРодительномПадеже);
			
			// дебет
			Если Не УчитыватьПереоценкуОтдельно Тогда
				Проводка["Счет"+СторонаКредитногоИнструмента] = СчетУчета;
			Иначе
				Проводка["Счет"+СторонаКредитногоИнструмента] = СчетУчетаПереоценки;
			КонецЕсли;
			
			Если ТипЗнч(ТекСтрокаКредитныеИнструменты.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
				Проводка["Субконто"+СторонаКредитногоИнструмента].ДепозитныеВклады = ТекСтрокаКредитныеИнструменты.КредитныйИнструмент;
			Иначе
				ДанныеЗайма = РаботаСКредитнымиИнструментами.ПолучитьДанныеКредитногоИнструмента(ТекСтрокаКредитныеИнструменты.КредитныйИнструмент, ЭтотОбъект.Дата);
				Проводка["Субконто"+СторонаКредитногоИнструмента].Контрагенты =  ДанныеЗайма.Контрагент;
				Проводка["Субконто"+СторонаКредитногоИнструмента].Займы = ТекСтрокаКредитныеИнструменты.КредитныйИнструмент;
			КонецЕсли;
			
			// кредит
			Проводка["Счет"+СторонаДоходовРасходов] = СчетДоходаРасхода;
			Проводка["Субконто"+СторонаДоходовРасходов].ПрочиеДоходыИРасходы = АналитикаДоходовОтПереоценки;
			Проводка["Субконто"+СторонаДоходовРасходов].ЦенныеБумаги         = ТекСтрокаКредитныеИнструменты.КредитныйИнструмент;
			
			Если УчитыватьДосрочноПолученныеПроцентыПоДепозитнымВкладамВДоходахБудущихПериодов Тогда
				Если Не ДоходыБудущихПериодов.Найти(ТекСтрокаКредитныеИнструменты.КредитныйИнструмент, "ДепозитныйВклад") = Неопределено Тогда
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаПроводки, "Переоценка депозитного вклада");
					
					// дебет
					Проводка.СчетДт = ПланыСчетов.Основной.ДоходыБудущихПериодов;
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаДоходовОтПереоценки;
					Проводка.СубконтоДт.ЦенныеБумаги         = ТекСтрокаКредитныеИнструменты.КредитныйИнструмент;
					
					// кредит
					Если Не УчитыватьПереоценкуОтдельно Тогда
						Проводка.СчетКт = СчетУчета;
					Иначе
						Проводка.СчетКт = СчетУчетаПереоценки;
					КонецЕсли;
					
					Проводка.СубконтоКт.ДепозитныеВклады = ТекСтрокаКредитныеИнструменты.КредитныйИнструмент;
					
				КонецЕсли;
			КонецЕсли;
		
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ЗАПОЛНЕНИЕ

Процедура ЗаполнитьДепозитыЕПС(Отказ)

	ДатаПереоценки = НачалоДня(ЭтотОбъект.Дата);
	Депозиты = РаботаСКредитнымиИнструментами.ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, 
		КонецДня(ДатаПереоценки), Перечисления.ТипыКредитныхИнструментов.ДепозитныйВклад,,, Истина);

	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ДатаПереоценки, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	
	НастройкиЦелиРасчета = БухгалтерскийУчет.ОпределитьНастройкиЦелиРасчета(ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Депозиты.КредитныйИнструмент КАК ДепозитныйВклад,
		|	Депозиты.Номинал КАК Номинал,
		|	Депозиты.Проценты КАК Проценты
		|ПОМЕСТИТЬ ТаблицаДепозитов
		|ИЗ
		|	&Депозиты КАК Депозиты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДепозитов.ДепозитныйВклад КАК ДепозитныйВклад,
		|	ТаблицаДепозитов.Номинал КАК Номинал,
		|	ТаблицаДепозитов.Проценты КАК Проценты,
		|	МАКСИМУМ(РасчетныеПоказателиДепозитногоВклада.Период) КАК Период
		|ПОМЕСТИТЬ ДепозитыСПериодамиРасчетныхДанных
		|ИЗ
		|	ТаблицаДепозитов КАК ТаблицаДепозитов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасчетныеПоказателиДепозитногоВклада КАК РасчетныеПоказателиДепозитногоВклада
		|		ПО ТаблицаДепозитов.ДепозитныйВклад = РасчетныеПоказателиДепозитногоВклада.ДепозитныйВклад
		|			И (&Период > РасчетныеПоказателиДепозитногоВклада.Период)
		|			И (РасчетныеПоказателиДепозитногоВклада.ЦельРасчета = &ЦельРасчета)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДепозитов.ДепозитныйВклад,
		|	ТаблицаДепозитов.Номинал,
		|	ТаблицаДепозитов.Проценты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДепозитыСПериодамиРасчетныхДанных.ДепозитныйВклад КАК ДепозитныйВклад,
		|	ДепозитыСПериодамиРасчетныхДанных.Номинал КАК Номинал,
		|	ДепозитыСПериодамиРасчетныхДанных.Проценты КАК Проценты,
		|	ДепозитыСПериодамиРасчетныхДанных.Период КАК Период,
		|	ЕстьNULL(РасчетныеПоказателиДепозитногоВклада.ЭффективнаяСтавкаПроцента, 0) КАК ЭффективнаяСтавкаПроцента,
		|	ЕстьNULL(РасчетныеПоказателиДепозитногоВклада.ИспользоватьЭффективнуюПроцентнуюСтавку, Ложь) КАК ИспользоватьЭффективнуюПроцентнуюСтавку,
		|	РАЗНОСТЬДАТ(ДепозитыСПериодамиРасчетныхДанных.Период, &Период, ДЕНЬ) КАК ДнейРасчета
		|ИЗ
		|	ДепозитыСПериодамиРасчетныхДанных КАК ДепозитыСПериодамиРасчетныхДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасчетныеПоказателиДепозитногоВклада КАК РасчетныеПоказателиДепозитногоВклада
		|		ПО ДепозитыСПериодамиРасчетныхДанных.ДепозитныйВклад = РасчетныеПоказателиДепозитногоВклада.ДепозитныйВклад
		|			И ДепозитыСПериодамиРасчетныхДанных.Период = РасчетныеПоказателиДепозитногоВклада.Период
		|			И (РасчетныеПоказателиДепозитногоВклада.ЦельРасчета = &ЦельРасчета)";
	
	Запрос.УстановитьПараметр("Период", КонецДня(ДатаПереоценки));
	Запрос.УстановитьПараметр("Депозиты", Депозиты);
	Запрос.УстановитьПараметр("ЦельРасчета", Справочники.ЦелиРасчета.ЕдиныйПланСчетов);		
	
	Депозиты = Запрос.Выполнить().Выгрузить();
	
	ЭтотОбъект.КредитныеИнструменты.Очистить();
	
	Для каждого СтрокаДепозиты Из Депозиты Цикл
	
		НоваяСтрока = ЭтотОбъект.КредитныеИнструменты.Добавить();
		
		НоваяСтрока.КредитныйИнструмент = СтрокаДепозиты.ДепозитныйВклад;
		НоваяСтрока.Номинал = СтрокаДепозиты.Номинал;
		НоваяСтрока.ОценочнаяСумма = СтрокаДепозиты.Номинал + СтрокаДепозиты.Проценты;
		НоваяСтрока.БалансоваяСумма = СтрокаДепозиты.Номинал;
		НоваяСтрока.СуммаПоЭСП = 0;
		
		Если НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Атомфонд2018 // эти - по амортизированной
			ИЛИ НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Газфонд   // остальные - ниже по рынку
		Тогда 
			Если ЗначениеЗаполнено(СтрокаДепозиты.ИспользоватьЭффективнуюПроцентнуюСтавку) Тогда			
				Если СтрокаДепозиты.ИспользоватьЭффективнуюПроцентнуюСтавку Тогда
					НоваяСтрока.СуммаПоЭСП = Справочники.ДепозитныеВклады.РасчитатьСтоимостьПоЭСП(
						СтрокаДепозиты.ДепозитныйВклад,
						КонецДня(ДатаПереоценки),
						Справочники.ЦелиРасчета.ЕдиныйПланСчетов,
						НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов);
				КонецЕсли;			
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдены расчетные показатели депозитного вклада " + СтрокаДепозиты.ДепозитныйВклад, СтрокаДепозиты.ДепозитныйВклад);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК Счет,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Субконто2,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).ВалютаУчета <> ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|	КОНЕЦ КАК СуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (&СчетаУчетаПроцентовПоДепозитам),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки";

	СчетаУчетаПроцентовПоДепозитам = Новый Массив;
	СчетаУчетаПроцентовПоДепозитам.Добавить(ПланыСчетов.Единый.Депозиты03);
	СчетаУчетаПроцентовПоДепозитам.Добавить(ПланыСчетов.Единый.Депозиты09);
	СчетаУчетаПроцентовПоДепозитам.Добавить(ПланыСчетов.Единый.Депозиты11);
	СчетаУчетаПроцентовПоДепозитам.Добавить(ПланыСчетов.Единый.Депозиты13);
	
	Запрос.УстановитьПараметр("ВидСубконто",					ПланыВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов);
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период",							Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетаУчетаПроцентовПоДепозитам",	СчетаУчетаПроцентовПоДепозитам);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Для каждого СтрокаДепозиты Из ЭтотОбъект.КредитныеИнструменты Цикл
			
			Если СтрокаДепозиты.КредитныйИнструмент <> ВыборкаДетальныеЗаписи.Субконто2 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.Единый.Депозиты03 ИЛИ ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.Единый.Депозиты13 Тогда // проценты по депозиту
			
				СтрокаДепозиты.БалансоваяСумма = СтрокаДепозиты.БалансоваяСумма + ВыборкаДетальныеЗаписи.СуммаОстаток; // к балансу, в оценке они уже есть
				
			ИначеЕсли ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.Единый.Депозиты09 ИЛИ ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.Единый.Депозиты11 Тогда // корректировка по депозиту
				
				СтрокаДепозиты.БалансоваяСумма = СтрокаДепозиты.БалансоваяСумма + ВыборкаДетальныеЗаписи.СуммаОстаток; // к балансу, в оценке они уже есть
				СтрокаДепозиты.ОценочнаяСумма = СтрокаДепозиты.ОценочнаяСумма + ВыборкаДетальныеЗаписи.СуммаОстаток; // и к оценке, чтобы нормально % и корректировка начислились
				
				Если НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости <> Справочники.ВариантыРасчетаОценочнойСтоимости.Атомфонд2018 // 
					И НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости <> Справочники.ВариантыРасчетаОценочнойСтоимости.Газфонд
				Тогда // для всех кроме Атомов и Газфонда тут будет начисленная корректировка
					СтрокаДепозиты.СуммаПоЭСП = СтрокаДепозиты.СуммаПоЭСП + ВыборкаДетальныеЗаписи.СуммаОстаток; 
				КонецЕсли;				
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	// расчет по рыночным настройкам
	СтоимостиДепозитныхВкладов = РаботаСКредитнымиИнструментами.ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияПоРыночнойСтавкеСУчетомПериодичностиОценки(
		ЭтотОбъект.СчетДоверительногоУправления,
		КонецДня(ЭтотОбъект.Дата),
		Справочники.ЦелиРасчета.ЕдиныйПланСчетов,
		Перечисления.ТипыКредитныхИнструментов.ДепозитныйВклад,,, Отказ);

	Если НЕ Отказ Тогда
		Для Каждого ВыборкаСтоимостиДепозитов из СтоимостиДепозитныхВкладов Цикл 
			Для каждого СтрокаДепозиты Из ЭтотОбъект.КредитныеИнструменты Цикл
				Если СтрокаДепозиты.КредитныйИнструмент <> ВыборкаСтоимостиДепозитов.КредитныйИнструмент Тогда
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(ВыборкаСтоимостиДепозитов.ПроцентыЭСП) Тогда 
					СтрокаДепозиты.СуммаПоЭСП = СтрокаДепозиты.ОценочнаяСумма + ВыборкаСтоимостиДепозитов.ПроцентыЭСП; 
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
		
КонецПроцедуры

Функция РассчитатьАмортизированнуюСтоимость(ДепозитныйВклад, ЭСП, ДатаРасчета)
	
	РасчетнаяСтоимость = 0;
	
	Для каждого СтрокаТаблицыПлатежей Из ДепозитныйВклад.ПлановыеВыплаты Цикл
		
		Если СтрокаТаблицыПлатежей.Период < ДатаРасчета Тогда
			Продолжить;
		КонецЕсли; 
		
		КолДней = (НачалоДня(СтрокаТаблицыПлатежей.Период) - НачалоДня(ДатаРасчета)) / 86400;
		
		ДПоток = СтрокаТаблицыПлатежей.Сумма / Pow(1 + ЭСП / 100, КолДней / 365) ;
		
		РасчетнаяСтоимость = РасчетнаяСтоимость + ДПоток;
		
	КонецЦикла;
	
	Возврат РасчетнаяСтоимость;

КонецФункции

Процедура ЗаполнитьКредитныеИнструменты(Отказ) Экспорт

	Если ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
		ЗаполнитьДепозитыЕПС(Отказ);
		Возврат;
		
	ИначеЕсли ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет Тогда
		
		ИмяДвижений = "БухгалтерскийУчет";
		
	ИначеЕсли ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет Тогда
		
		ИмяДвижений = "НалоговыйУчет";
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран вид учета",,,, Отказ); 
		Возврат;
		
	КонецЕсли;
	
	СтоимостьКакВРСА = Документы.ПереоценкаКредитныхИнструментов.ОпределятьСтоимостьКредитныхИнструментовКакВРСА(ЭтотОбъект.ВидУчета, СчетДоверительногоУправления.ВидДоговораДоверительногоУправления);
	
	СтоимостьКредитныхИнструментов = Документы.ПереоценкаКредитныхИнструментов.ОпределитьСтоимостьКредитныхИнструментов(
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		КонецДня(ЭтотОбъект.Дата),
		ЭтотОбъект.ВидУчета,
		СтоимостьКакВРСА,
		Отказ);
		
	ЭтотОбъект.КредитныеИнструменты.Очистить();
	
	Для каждого СтрокаСтоимости Из СтоимостьКредитныхИнструментов Цикл
	
		НоваяСтрока = ЭтотОбъект.КредитныеИнструменты.Добавить();
		
		НоваяСтрока.КредитныйИнструмент = СтрокаСтоимости.КредитныйИнструмент;
		НоваяСтрока.Номинал = СтрокаСтоимости.Номинал;
		
		НоваяСтрока.ОценочнаяСумма = СтрокаСтоимости.Номинал + СтрокаСтоимости.Проценты;
		Если СтоимостьКакВРСА Тогда
			НоваяСтрока.ОценочнаяСумма = НоваяСтрока.ОценочнаяСумма + СтрокаСтоимости.СуммаРезерва;
		КонецЕсли;
		
		НоваяСтрока.БалансоваяСумма = СтрокаСтоимости.Номинал;
	
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.Субконто1 КАК Субконто1,
		|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоДепозитнымВкладам),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДепозитныеВклады),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухгалтерскийУчетОстатки.Субконто1,
		|	БухгалтерскийУчетОстатки.СуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоЗаймамВыданным),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Займы),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухгалтерскийУчетОстатки.Субконто1,
		|	-БухгалтерскийУчетОстатки.СуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоКраткосрочнымЗаймамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоДолгосрочнымЗаймамПолученным)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Займы),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", ИмяДвижений);
		
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период",			Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Для каждого СтрокаКредитныйИнструмент Из ЭтотОбъект.КредитныеИнструменты Цикл
			Если СтрокаКредитныйИнструмент.КредитныйИнструмент = ВыборкаДетальныеЗаписи.Субконто1 Тогда
				СтрокаКредитныйИнструмент.БалансоваяСумма = СтрокаКредитныйИнструмент.БалансоваяСумма + ВыборкаДетальныеЗаписи.СуммаОстаток;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрименитьПолитикуУчета() Экспорт

	ДатаПереоценки = НачалоДня(ЭтотОбъект.Дата);
	
	ЕстьПоручениеНаПереоценку = РаботаСПереоценкой.ОпределитьНаличиеПорученияНаПереоценку(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ДатаПереоценки, ЭтотОбъект.ВидУчета, Перечисления.ВидыАктивовДляПорученийНаПереоценку.ДепозитныеВклады);	
	
	ПериодичностиДатыПереоценки = БухгалтерскийУчетЕПС.ПолучитьПериодичностиДаты(ДатаПереоценки);
	
	КалендарьДляСчетаДУ = РаботаСПереоценкой.ПолучитьКалендарьДляСчетаДУ(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ДатаПереоценки);

	РабочийДень = Справочники.Календари.ЭтоРабочийДень(КалендарьДляСчетаДУ, ДатаПереоценки);
	
	
	Для каждого СтрокаКредитныйИнструмент Из ЭтотОбъект.КредитныеИнструменты Цикл
		
		Если ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
			УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(ЭтотОбъект.Дата, ,СтрокаКредитныйИнструмент.КредитныйИнструмент);
		Иначе	
			УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(ЭтотОбъект.Дата, ,СтрокаКредитныйИнструмент.КредитныйИнструмент);
		КонецЕсли; 
		
		Если ЕстьПоручениеНаПереоценку Тогда
		
			Переоценивать = Истина;
			
		Иначе
			
			ПериодичностьПереоценки = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(ДатаПереоценки, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, УчетныйАктив, ЭтотОбъект.ВидУчета, "ПериодичностьПереоценки");
			ПереоцениватьВНерабочиеДни = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(ДатаПереоценки, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, УчетныйАктив, ЭтотОбъект.ВидУчета, "ПереоцениватьВНерабочиеДни");
			
			Переоценивать = Ложь;
			Если ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно Тогда
				Если ПериодичностиДатыПереоценки.ПериодичностьМесяц Тогда
				    Переоценивать = Истина;
				ИначеЕсли РабочийДень Тогда
					Переоценивать = Истина;
				ИначеЕсли ПереоцениватьВНерабочиеДни Тогда
					Переоценивать = Истина;
				КонецЕсли;
			ИначеЕсли БухгалтерскийУчетЕПС.ПроверкаНеобходимостиПереоценки(ПериодичностьПереоценки, ДатаПереоценки, КалендарьДляСчетаДУ) Тогда	
				Переоценивать = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ Переоценивать Тогда
			СтрокаКредитныйИнструмент.ОценочнаяСумма = СтрокаКредитныйИнструмент.БалансоваяСумма;
		КонецЕсли;
		
		
		Если ЭтотОбъект.ВидУчета <> Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЕстьПоручениеНаПереоценку Тогда
		
			НачислятьЭСП = Истина;
			
		Иначе
			
			ПериодичностьНачисленияЭСП = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(ДатаПереоценки, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, УчетныйАктив, ЭтотОбъект.ВидУчета, "ПериодичностьНачисленияКорректировкиЭСП");
			
			НачислятьЭСП = Ложь;
			Если ПериодичностьНачисленияЭСП = Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно Тогда
				Если ПериодичностиДатыПереоценки.ПериодичностьМесяц Тогда
				    НачислятьЭСП = Истина;
				ИначеЕсли РабочийДень Тогда
					НачислятьЭСП = Истина;
				ИначеЕсли ПереоцениватьВНерабочиеДни Тогда
					НачислятьЭСП = Истина;
				КонецЕсли;
			ИначеЕсли БухгалтерскийУчетЕПС.ПроверкаНеобходимостиПереоценки(ПериодичностьНачисленияЭСП, ДатаПереоценки, КалендарьДляСчетаДУ) Тогда
				НачислятьЭСП = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ НачислятьЭСП Тогда
			СтрокаКредитныйИнструмент.СуммаПоЭСП = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
